{{- if (eq .chezmoi.os "darwin") -}}
cask_args appdir: "/Applications"
tap "esolitos/ipa" # Required for sshpass
tap "espanso/espanso" # Required for Espanso
tap "mtslzr/marmaduke-chromium" # Required for chromium
tap "homebrew/cask-drivers"

brew "mas"

mas "1Blocker", id: 1365531024
mas "1Password", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Keka", id: 470158793
mas "Soulver 2", id: 413965349
mas "Wireguard", id: 1451685025

cask "1password-cli"
cask "android-platform-tools"
cask "bartender"
cask "bettertouchtool"
cask "chronosync"
cask "discord"
cask "drawio"
cask "espanso"
cask "forklift"
cask "gpg-suite"
cask "iterm2"
cask "maccy"
cask 'marmaduke-chromium'
cask "obsidian"
cask "raycast"
cask "rocket"
cask "shottr"
cask "visual-studio-code"

brew 'coreutils'
brew 'findutils'
brew 'fish'
brew 'grep'
brew 'git'
brew 'gnu-sed'
brew 'pinentry-mac'
brew 'pre-commit'
brew 'esolitos/ipa/sshpass'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'ykman'

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"

{{ if $.personal -}}
# Personal tools
mas "Home Assistant", id: 1099568401
mas "MQTT Explorer", id: 1455214828
mas "Parcel", id: 639968404
mas "Reeder", id: 1529448980
mas "Twitterific", id: 1289378661

cask "anylist"
cask "autodesk-fusion360"
cask "calibre"
cask "iina"
cask "meta"
cask "plex"
cask "raspberry-pi-imager"
cask "sonos"
cask "superslicer"
cask "whatsapp"
{{- end }}

{{- end }}
